       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG786.
      *----------------------------------------------------------------*
      * CUADRO PAGOS SEGURIDAD SOCIAL Y PARAFISCALES.ABR-27-2002       *
      *----------------------------------------------------------------*
       ENVIRONMENT   DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "..\DYC\USER-ACT.DYC".
           COPY "..\DYC\EMPRESAS.DYC".
           COPY "..\DYC\WTEMP786.DYC".
           COPY "..\DYC\AUTOAPOR.DYC".
           COPY "..\DYC\FONPENSI.DYC".
           COPY "..\DYC\EPSLIQUI.DYC".
           COPY "..\DYC\WTEMN786.DYC".
           COPY "..\DYC\CAJACOLT.DYC".
           COPY "..\DYC\CONTRATO.DYC".
           COPY "..\DYC\TABLAEMP.DYC".
           COPY "..\DYC\TARIESGO.DYC".
           COPY "..\DYC\ACINCVAC.DYC".
           COPY "..\DYC\ACUMSESO.DYC".
           COPY "..\DYC\FORMAUTO.DYC".
           COPY "..\DYC\NOMICIUD.DYC".
           COPY "..\DYC\PROMSALU.DYC".
           COPY "..\DYC\FPENSION.DYC".
           COPY "..\DYC\CJASUBSI.DYC".
           COPY "..\DYC\FORMUEPS.DYC".
           COPY "..\SEL\LISTADOS.SEL".
           COPY "..\SEL\INFORMES.SEL".
           COPY "..\SEL\REPORTES.SEL".
           COPY "..\SEL\CERTIFIC.SEL".
           COPY "..\DYC\MVDOCTOS.DYC".
           COPY "..\DYC\CNPARAFI.DYC".
           COPY "..\DYC\CNCUADRO.DYC".
           COPY "..\DYC\TBREDECI.DYC".
       DATA DIVISION.
       FILE SECTION.
           COPY "..\FD\USER-ACT.FD".
           COPY "..\FD\EMPRESAS.FD".
           COPY "..\FD\ACUMSESO.FD".
           COPY "..\FD\INFORMES.FD".
           COPY "..\FD\WTEMP786.FD".
           COPY "..\FD\AUTOAPOR.FD".
           COPY "..\FD\FONPENSI.FD".
           COPY "..\FD\EPSLIQUI.FD".
           COPY "..\FD\WTEMN786.FD".
           COPY "..\FD\REPORTES.FD".
           COPY "..\FD\CAJACOLT.FD".
           COPY "..\FD\CONTRATO.FD".
           COPY "..\FD\TABLAEMP.FD".
           COPY "..\FD\TARIESGO.FD".
           COPY "..\FD\ACINCVAC.FD".
           COPY "..\FD\FORMAUTO.FD".
           COPY "..\FD\NOMICIUD.FD".
           COPY "..\FD\PROMSALU.FD".
           COPY "..\FD\FPENSION.FD".
           COPY "..\FD\CJASUBSI.FD".
           COPY "..\FD\LISTADOS.FD".
           COPY "..\FD\FORMUEPS.FD".
           COPY "..\FD\MVDOCTOS.FD".
           COPY "..\FD\CNPARAFI.FD".
           COPY "..\FD\CNCUADRO.FD".
           COPY "..\FD\TBREDECI.FD".
           COPY "..\FD\CERTIFIC.FD".
       WORKING-STORAGE SECTION.
       77  ID-PRG               PIC X(07)  VALUE "PROG786".
       77  W-PROGRAMA           PIC X(07)  VALUE "PROG786".
       77  W-RIESGOS-PROFE      PIC 9(09)  VALUE ZEROS.
       77  W-COSTO              PIC X(01)  VALUE SPACES.
       77  W-AUXE-CALCULO       PIC 9(09)  VALUE ZEROS.
       77  W-AUXP-CALCULO       PIC 9(09)  VALUE ZEROS.
       77  IND-FONPENSI         PIC 9(01)  VALUE ZEROS.
       77  IND-CAJACOLT         PIC 9(01)  VALUE ZEROS.
       77  IND-SW               PIC 9(01)  VALUE ZEROS.
       77  WK-NIT               PIC 9(12)  VALUE ZEROS.
       77  IND-EPSLIQUI         PIC 9(01)  VALUE ZEROS.
       77  W-CIUDAD             PIC 9(05)  VALUE ZEROS.
       77  WA-VLR               PIC 9(10)  VALUE ZEROS.
       77  W-VARIABLES-NOMINA   PIC X(7)   VALUE SPACES.
       77  WK-CUENTA-CREDITO    PIC 9(10)  VALUE ZEROS.
      *
       01  WK-CUENTA-DEBITO.
         03 WK-MAYOR1        PIC 9(2).
         03 WK-MAYOR2        PIC 9(2).
         03 WK-SUB           PIC 9(2).
         03 WK-AUX           PIC 9(4).

       01  WK-ENTIDAD.
         03 K-ENTIDAD        PIC X(06) VALUE "TOTAL".
         03 K-CIUDAD         PIC X(09) VALUE SPACES.

       01  W-ACUMULADOS.
         03 W-ACUM-LINE.
           05 W-LINE-PATR  PIC 9(09).
           05 W-LINE-EMPL  PIC 9(09).
           05 W-LINE-COTI  PIC 9(09).
           05 W-LINE-PAGA  PIC S9(09).
           05 W-LINE-SUB1  PIC S9(09).
         03 W-ACUM-CIUD.
           05 W-CIUD-SALUP PIC 9(09).
           05 W-CIUD-SALUE PIC 9(09).
           05 W-CIUD-SALUD PIC 9(09).
           05 W-CIUD-PENSP PIC 9(09).
           05 W-CIUD-PENSE PIC 9(09).
           05 W-CIUD-PENSI PIC 9(09).
           05 W-CIUD-FSP   PIC 9(09).
           05 W-CIUD-VOLUN PIC 9(09).
           05 W-CIUD-RIESG PIC 9(09).
           05 W-CIUD-INCAP PIC 9(09).
           05 W-CIUD-ICBF  PIC 9(09).
           05 W-CIUD-SENA  PIC 9(09).
           05 W-CIUD-SUFA  PIC 9(09).
           05 W-CIUD-TOTA  PIC 9(09).
           05 W-CIUD-PATR  PIC 9(09).
           05 W-CIUD-EMPL  PIC 9(09).
           05 W-CIUD-COTI  PIC 9(09).
           05 W-CIUD-PAGA  PIC S9(09).
           05 W-CIUD-SUB1  PIC S9(09).
         03 W-ACUM-COST.
           05 W-COST-SALUP PIC 9(09).
           05 W-COST-SALUE PIC 9(09).
           05 W-COST-SALUD PIC 9(09).
           05 W-COST-PENSP PIC 9(09).
           05 W-COST-PENSE PIC 9(09).
           05 W-COST-PENSI PIC 9(09).
           05 W-COST-FSP   PIC 9(09).
           05 W-COST-VOLUN PIC 9(09).
           05 W-COST-RIESG PIC 9(09).
           05 W-COST-INCAP PIC 9(09).
           05 W-COST-ICBF  PIC 9(09).
           05 W-COST-SENA  PIC 9(09).
           05 W-COST-SUFA  PIC 9(09).
           05 W-COST-TOTA  PIC 9(09).
           05 W-COST-PATR  PIC 9(09).
           05 W-COST-EMPL  PIC 9(09).
           05 W-COST-COTI  PIC 9(09).
           05 W-COST-PAGA  PIC S9(09).
           05 W-COST-SUB1  PIC S9(09).
         03 W-ACUM-TOTA.
           05 W-TOTA-SALUP PIC 9(09).
           05 W-TOTA-SALUE PIC 9(09).
           05 W-TOTA-SALUD PIC 9(09).
           05 W-TOTA-PENSP PIC 9(09).
           05 W-TOTA-PENSE PIC 9(09).
           05 W-TOTA-PENSI PIC 9(09).
           05 W-TOTA-FSP   PIC 9(09).
           05 W-TOTA-VOLUN PIC 9(09).
           05 W-TOTA-RIESG PIC 9(09).
           05 W-TOTA-INCAP PIC 9(09).
           05 W-TOTA-ICBF  PIC 9(09).
           05 W-TOTA-SENA  PIC 9(09).
           05 W-TOTA-SUFA  PIC 9(09).
           05 W-TOTA-TOTA  PIC 9(09).
           05 W-TOTA-PATR  PIC 9(09).
           05 W-TOTA-EMPL  PIC 9(09).
           05 W-TOTA-COTI  PIC 9(09).
           05 W-TOTA-PAGA  PIC S9(09).
           05 W-TOTA-SUB1  PIC S9(09).
      *
        03     LINEA-ERROR.
         05    FILLER      PIC X(01).
         05    I-DPTO      PIC 9(03).
         05    FILLER      PIC X(01).
         05    I-CIUDAD    PIC 9(05).
         05    FILLER      PIC X(02).
         05    I-ORDEN     PIC 9(01).
         05    FILLER      PIC X(02).
         05    I-ENTIDAD   PIC 9(02).
         05    FILLER      PIC X(02).
         05    I-NOMBRE    PIC X(20).
         05    FILLER      PIC X(02).

           COPY "..\LBL\USER-ACT.LBL".
           COPY "..\LBL\EMPRESAS.LBL".
           COPY "..\LBL\INFORMES.LBL".
           COPY "..\LBL\WTEMP786.LBL".
           COPY "..\LBL\AUTOAPOR.LBL".
           COPY "..\LBL\FONPENSI.LBL".
           COPY "..\LBL\EPSLIQUI.LBL".
           COPY "..\LBL\WTEMN786.LBL".
           COPY "..\LBL\ACUMSESO.LBL".
           COPY "..\LBL\REPORTES.LBL".
           COPY "..\LBL\CAJACOLT.LBL".
           COPY "..\LBL\CONTRATO.LBL".
           COPY "..\LBL\TABLAEMP.LBL".
           COPY "..\LBL\TARIESGO.LBL".
           COPY "..\LBL\ACINCVAC.LBL".
           COPY "..\LBL\FORMAUTO.LBL".
           COPY "..\LBL\NOMICIUD.LBL".
           COPY "..\LBL\PROMSALU.LBL".
           COPY "..\LBL\FPENSION.LBL".
           COPY "..\LBL\CJASUBSI.LBL".
           COPY "..\LBL\LISTADOS.LBL".
           COPY "..\LBL\FORMUEPS.LBL".
           COPY "..\LBL\MVDOCTOS.LBL".
           COPY "..\LBL\CNPARAFI.LBL".
           COPY "..\LBL\CNCUADRO.LBL".
           COPY "..\LBL\TBREDECI.LBL".
           COPY "..\LBL\CERTIFIC.LBL".
      *
           COPY "..\WRK\USER-ACT.WRK".
           COPY "..\WRK\IO-ERROR.WRK".
           COPY "..\WRK\TECLADOS.WRK".
           COPY "..\WRK\NO-ERROR.WRK".
           COPY "..\WRK\WK-RAYAS.WRK".
           COPY "..\WRK\TABLAMES.WRK".
           COPY "..\WRK\TABLAGEN.WRK".
           COPY "..\WRK\VARIAULQ.WRK".
           COPY "..\WRK\LISTADOS.WRK".
           COPY "..\WRK\INFOR786.WRK".
           COPY "..\WRK\REPOR786.WRK".
           COPY "..\WRK\147C8X11.WRK".
           COPY "..\WRK\CONTROLA.WRK".
      *
           COPY "..\LNK\CONTROLA.LNK".
      *
       PROCEDURE DIVISION  USING  AREA-LINK-NOMINA.
       DECLARATIVES.
           COPY "..\DCL\USER-ACT.DCL".
           COPY "..\DCL\EMPRESAS.DCL".
           COPY "..\DCL\INFORMES.DCL".
           COPY "..\DCL\WTEMP786.DCL".
           COPY "..\DCL\AUTOAPOR.DCL".
           COPY "..\DCL\MVDOCTOS.DCL".
           COPY "..\DCL\CNPARAFI.DCL".
           COPY "..\DCL\CNCUADRO.DCL".
           COPY "..\DCL\ACUMSESO.DCL".
           COPY "..\DCL\TBREDECI.DCL".
           COPY "..\DCL\CERTIFIC.DCL".
           COPY "..\DCL\FONPENSI.DCL".
           COPY "..\DCL\EPSLIQUI.DCL".
           COPY "..\DCL\WTEMN786.DCL".
           COPY "..\DCL\REPORTES.DCL".
           COPY "..\DCL\CAJACOLT.DCL".
           COPY "..\DCL\CONTRATO.DCL".
           COPY "..\DCL\TABLAEMP.DCL".
           COPY "..\DCL\TARIESGO.DCL".
           COPY "..\DCL\ACINCVAC.DCL".
           COPY "..\DCL\FORMAUTO.DCL".
           COPY "..\DCL\NOMICIUD.DCL".
           COPY "..\DCL\PROMSALU.DCL".
           COPY "..\DCL\FPENSION.DCL".
           COPY "..\DCL\CJASUBSI.DCL".
           COPY "..\DCL\LISTADOS.DCL".
           COPY "..\DCL\FORMUEPS.DCL".
       END DECLARATIVES.
       PROGRAMA-PRINCIPAL SECTION.
       I-MAIN-PROCESS.
           COPY "..\PRO\CONTROLA.PRO".
           PERFORM I-USUARIOS         THRU F-USUARIOS.
           IF      SW-USER = 1        EXIT PROGRAM.
           PERFORM I-PANTALLA-1B      THRU F-PANTALLA-1B.
           PERFORM I-LABEL-ARCHIVOS   THRU F-LABEL-ARCHIVOS.
           PERFORM I-ABRE-ARCHIVOS    THRU F-ABRE-ARCHIVOS.
           PERFORM I-PANTALLA         THRU F-PANTALLA.
           MOVE    ZEROS                TO IND-SW.
           PERFORM I-PROCESO-ISS      THRU F-PROCESO-ISS.
           PERFORM I-PROCESO-INCAPACI THRU F-PROCESO-INCAPACI.
           IF IND-FONPENSI = 0
              PERFORM I-PROCESO-AFP   THRU F-PROCESO-AFP.
           IF IND-EPSLIQUI = 0
              PERFORM I-PROCESO-EPS   THRU F-PROCESO-EPS.
           PERFORM I-PROCESO-FORMUEPS THRU F-PROCESO-FORMUEPS.
           IF IND-CAJACOLT = 0
              PERFORM I-PROCESO-CAJAS THRU F-PROCESO-CAJAS.
           PERFORM I-PROCESO-INFORME  THRU F-PROCESO-INFORME.
           PERFORM I-PROCESO-REPORTE  THRU F-PROCESO-REPORTE.
           PERFORM I-FIN-MODE         THRU F-FIN-MODE.
       F-MAIN-PROCESS.
      *
       I-LABEL-ARCHIVOS.
           MOVE W-IDENT-PROGRAMA       TO  CON-PROGRAMA
           MOVE "POR SEGURIDAD SOCIAL Y PARAFISCALES POR CIUDADES" TO
           IT03-DESCR.

           MOVE WEMPRESA TO W-NOMEMP-DE3.

           MOVE 3 TO IND-INFORMES.
           PERFORM  I-LABEL-INFORMES THRU F-LABEL-INFORMES.
           MOVE  WK-ANO-DESDE          TO LAB-INFORMES-ANO
      *
           MOVE 3 TO IND-CERTIFIC.
           PERFORM  I-LABEL-CERTIFIC THRU  F-LABEL-CERTIFIC.
           MOVE  WK-ANO-DESDE          TO  LAB-CERTIFIC-ANO

           MOVE 3 TO IND-REPORTES.
           PERFORM  I-LABEL-REPORTES    THRU F-LABEL-REPORTES.
           MOVE  WK-ANO-DESDE             TO  LAB-REPORTES-ANO

           MOVE 3 TO IND-LISTADOS.
           PERFORM  I-LABEL-LISTADOS    THRU F-LABEL-LISTADOS.
           MOVE  WK-ANO-DESDE  TO  LAB-LISTADOS-ANO

           PERFORM I-LABEL-AUTOAPOR THRU F-LABEL-AUTOAPOR.
           MOVE WK-ANO-DESDE TO LAB-AUTOAPOR-ANO.
           PERFORM I-LABEL-FONPENSI THRU F-LABEL-FONPENSI.
           MOVE WK-ANO-DESDE TO LAB-FONPENSI-ANO.
           PERFORM I-LABEL-EPSLIQUI THRU F-LABEL-EPSLIQUI.
           MOVE WK-ANO-DESDE TO LAB-EPSLIQUI-ANO.
           PERFORM I-LABEL-CAJACOLT THRU F-LABEL-CAJACOLT.
           MOVE WK-ANO-DESDE TO LAB-ANO-CAJACOLT.

           PERFORM I-LABEL-ACUMSESO THRU F-LABEL-ACUMSESO.

           PERFORM I-LABEL-ACINCVAC THRU F-LABEL-ACINCVAC.
           PERFORM I-LABEL-FORMAUTO THRU F-LABEL-FORMAUTO.
           PERFORM I-LABEL-WTEMP786 THRU F-LABEL-WTEMP786.
           PERFORM I-LABEL-WTEMN786 THRU F-LABEL-WTEMN786.
           PERFORM I-LABEL-FORMUEPS THRU F-LABEL-FORMUEPS.
           PERFORM I-LABEL-MVDOCTOS THRU F-LABEL-MVDOCTOS.
           MOVE    WK-ANO-DESDE       TO LAB-MVDOCTOS-ANO
           MOVE    W-LONG             TO LAB-MVDOCTOS-MES

           PERFORM I-TITULO-05 THRU F-TITULO-05.

           MOVE ZEROS TO WK-LINEAS WK-PAGINA
                         W-LINEAS-R W-PAGINA-R.
           MOVE WK-NOMBRE-MES (W-LONG) TO IT01-MES.
           MOVE WK-ANO-DESDE           TO IT01-ANO.

           MOVE WIN-EMPRESA  TO  WK-COMPANIA
           MOVE "¹"          TO  WK-RAYAS-U
           MOVE "Ì"          TO  WK-RAYAS-P
           MOVE "¶"          TO  WK-RAYA-U
           MOVE "Ç"          TO  WK-RAYA-P
           MOVE 1            TO  SW-ABRE.
           MOVE SPACE TO W-COSTO.
           MOVE ZEROS TO W-CIUDAD.
       F-LABEL-ARCHIVOS. EXIT.
      *
       I-TITULO-05.
           IF WK-ANO-DESDE >= 96
            MOVE "    12%"  TO IT05-SALUD
            MOVE "   13.5%" TO IT05-PENSI
           ELSE
            MOVE "C 8%,F 12%" TO IT05-SALUD
            MOVE "   12.5%"   TO IT05-PENSI.
       F-TITULO-05. EXIT.
      *
       I-ABRE-ARCHIVOS.
           PERFORM  I-STATUS-ACUMSESO  THRU  F-STATUS-ACUMSESO.

           OPEN INPUT  EMPRESAS AUTOAPOR ACUMSESO
                       TARIESGO NOMICIUD PROMSALU FPENSION CJASUBSI.

           OPEN INPUT  TBREDECI CNCUADRO CNPARAFI.
           OPEN OUTPUT MVDOCTOS CLOSE MVDOCTOS
           OPEN I-O    MVDOCTOS

           MOVE ZEROS TO SW-ABRE IND-EPSLIQUI.
           OPEN INPUT  EPSLIQUI.
           MOVE 1 TO SW-ABRE.
           IF EPSLIQUI-STATUS NOT = "00"
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " ERROR EPSLIQUI "     LINE 25 POSITION 01
             EPSLIQUI-STATUS        LINE 25 POSITION 20
             MOVE 1 TO IND-EPSLIQUI.

           MOVE ZEROS TO SW-ABRE IND-CAJACOLT.
           OPEN INPUT  CAJACOLT.
           MOVE 1 TO SW-ABRE.
           IF CAJACOLT-STATUS NOT = "00"
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " ERROR CAJACOLT "     LINE 25 POSITION 01
             CAJACOLT-STATUS        LINE 25 POSITION 20
             MOVE 1 TO IND-CAJACOLT.

           MOVE ZEROS TO SW-ABRE IND-FONPENSI.
           OPEN INPUT  FONPENSI.
           MOVE 1 TO SW-ABRE.
           IF FONPENSI-STATUS NOT = "00"
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " ERROR FONPENSI "     LINE 25 POSITION 01
             FONPENSI-STATUS        LINE 25 POSITION 20
             MOVE 1 TO IND-FONPENSI.

           OPEN OUTPUT INFORMES WTEMP786 WTEMN786 REPORTES LISTADOS
                        CERTIFIC.
           CLOSE WTEMP786 WTEMN786.
           OPEN I-O WTEMP786 WTEMN786.
       F-ABRE-ARCHIVOS. EXIT.
      *
       I-PANTALLA.
           PERFORM I-CABECERA-WINDOW THRU F-CABECERA-WINDOW.
           PERFORM I-PANTA           THRU F-PANTA.

           DISPLAY
           "ARCHIVO DE IMPRESION ---->" LINE 21 POSITION 03 BLINK
           LABEL-INFORMES               LINE 21 POSITION 30 REVERSE
           NOM-PAPEL (IND-INFORMES)     LINE 21 POSITION 66 REVERSE

           "RESUMEN NACIONAL     ---->" LINE 22 POSITION 03 BLINK
           LABEL-REPORTES               LINE 22 POSITION 30 REVERSE
           NOM-PAPEL (IND-REPORTES)     LINE 22 POSITION 66 REVERSE
           PERFORM I-ACEPTA-CONS         THRU F-ACEPTA-CONS
           PERFORM I-CONFIRM1            THRU F-CONFIRM1.
       F-PANTALLA. EXIT.
      *
       I-ACEPTA-CONS.
            DISPLAY "DIGITE NUMERO DE RADICACION" LINE 12 POSITION 10
            MOVE ZEROS          TO  WK-EXCEPTION
            ACCEPT W-DIA-HASTA      LINE 12 POSITION 40 REVERSE
                                    CONVERT TAB NO BEEP
                                    ON EXCEPTION WK-EX
                                    PERFORM 999-EXCEPTION.
            IF F2 PERFORM I-FIN-MODE THRU F-FIN-MODE.
            IF CUP  GO I-ACEPTA-CONS.
            IF W-DIA-HASTA = ZEROS GO I-ACEPTA-CONS.
       F-ACEPTA-CONS. EXIT.

       I-PROCESO-ISS.
           MOVE ZEROS TO AUTOAPOR-CLAVE WK-CEDULA-INI.
           PERFORM I-START-AUTOAPOR-MAYOR-KEY00 THRU
                   F-START-AUTOAPOR-MAYOR-KEY00.
           IF FIN-ARCH-AUTOAPOR = 1
             GO F-PROCESO-ISS.
           PERFORM I-PROCESO-ISS-INT THRU F-PROCESO-ISS-INT
             UNTIL FIN-ARCH-AUTOAPOR = 1.
       F-PROCESO-ISS. EXIT.
      *
       I-PROCESO-ISS-INT.
           PERFORM I-LEE-C-AUTOAPOR THRU F-LEE-C-AUTOAPOR.

           IF FIN-ARCH-AUTOAPOR = 1
             GO F-PROCESO-ISS-INT.

           DISPLAY AUTOAPOR-CLAVE LINE 25 POSITION 01.
           PERFORM I-AUTOAPOR-WTEMP786 THRU F-AUTOAPOR-WTEMP786.
       F-PROCESO-ISS-INT. EXIT.
      *
       I-AUTOAPOR-WTEMP786.
           IF AUTOAPOR-CIA-ALT3 =   1 OR
              AUTOAPOR-CIA-ALT3 = 301 OR
              AUTOAPOR-CIA-ALT3 = 302 OR
              AUTOAPOR-CIA-ALT3 = 303
             MOVE "G" TO WTEMP786-COSTO
           ELSE
             MOVE "C" TO WTEMP786-COSTO.

           MOVE 1 TO WTEMP786-FUENTE.


           MOVE AUTOAPOR-COD-CIUD-SUC TO WTEMP786-CIUDAD.
      *NJ  IF WTEMP786-CIUDAD > 50
      *NJ    COMPUTE WTEMP786-CIUDAD = WTEMP786-CIUDAD - 50.

           MOVE 1 TO WTEMP786-CODIGO.

           IF W-NOMEMP-DE3 = "ACT"
             IF AUTOAPOR-CIA-ALT3 = 500 OR
                AUTOAPOR-CIA-ALT3 = 501 OR
                AUTOAPOR-CIA-ALT3 = 502 OR
                AUTOAPOR-CIA-ALT3 = 503 OR
                AUTOAPOR-CIA-ALT3 = 504 OR
                AUTOAPOR-CIA-ALT3 = 505 OR
                AUTOAPOR-CIA-ALT3 = 506
                MOVE              3  TO WTEMP786-FUENTE
                MOVE             99  TO WTEMP786-CODIGO.

           IF W-NOMEMP-DE3 = "SER"
             IF AUTOAPOR-CIA-ALT3 = 100
               MOVE 3  TO WTEMP786-FUENTE
               MOVE 99 TO WTEMP786-CODIGO.

           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
                   WTEMP786-LLAVE-00 LINE 25 POSITION 01

           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS
             MOVE ZEROS TO WTEMP786-APORTE-PENSI
             MOVE ZEROS TO WTEMP786-APORTE-FSP
             MOVE ZEROS TO WTEMP786-APORTE-SALUD.


           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRBASE TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
            ADD WA-VLR         TO WTEMP786-BASE.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRAPORTE-SALUD TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMP786-APORTE-SALUD.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRAPORTE TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR                  TO WTEMP786-APORTE-PENSI.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-FSP TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMP786-APORTE-FSP.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-APORTE-EMPLEADO TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMP786-APORTE-VOLUN.

           MOVE ZEROS TO W-RIESGOS-PROFE.
           IF WK-CEDULA-INI NOT = AUTOAPOR-CED
            MOVE AUTOAPOR-CED TO WK-CEDULA-INI
            PERFORM I-LIQUIDA-RIESGOS THRU F-LIQUIDA-RIESGOS.
           ADD W-RIESGOS-PROFE TO WTEMP786-APORTE-RIESG.
           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
           W-RIESGOS-PROFE       LINE 25 POSITION 01
           WTEMP786-APORTE-RIESG LINE 25 POSITION 20
           IF WTEMP786-CIUDAD = 2
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             WTEMP786-APORTE-SALUD  LINE 25 POSITION 01
             MOVE AUTOAPOR-VRAPORTE-SALUD TO WI-Z11P
             DISPLAY WI-Z11P LINE 25 POSITION 30
             WA-VLR LINE 25 POSITION 45.

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.

           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
                   WTEMP786-LLAVE-00   LINE 25 POSITION 01.

           PERFORM I-NACIONAL-ISS THRU F-NACIONAL-ISS.
       F-AUTOAPOR-WTEMP786. EXIT.
      *
       I-LIQUIDA-RIESGOS.
           MOVE ZEROS TO W-RIESGOS-PROFE.
           IF WK-ANO-DESDE >= 98 AND W-LONG >= 06
             PERFORM I-RIESGO-ANTERIOR THRU F-RIESGO-ANTERIOR
             GO F-LIQUIDA-RIESGOS.

           MOVE AUTOAPOR-CIA-ALT3 TO LAB-MAESCIA LAB-CONTRATO-CIA.
           MOVE SPACES TO CONTRATO-STATUS.
           OPEN INPUT CONTRATO.
           MOVE 1 TO SW-ABRE.
           IF CONTRATO-STATUS = "35"
            MOVE ZEROS TO W-RIESGOS-PROFE
            GO F-LIQUIDA-RIESGOS.
           DISPLAY LABEL-CONTRATO LINE 25 POSITION 01

           MOVE AUTOAPOR-CIA-ALT3 TO LAB-TABLAEMPCIA
           MOVE SPACES TO TABLAEMP-STATUS.
           OPEN INPUT TABLAEMP.
           MOVE 1 TO SW-ABRE.
           IF TABLAEMP-STATUS = "35"
            MOVE ZEROS TO W-RIESGOS-PROFE
            GO F-LIQUIDA-RIESGOS.

           MOVE AUTOAPOR-CED TO CONTRATO-CEDULA.
           PERFORM I-LEE-CONTRATO-I00 THRU F-LEE-CONTRATO-I00.
           IF FIN-ARCH-CONTRATO = 1
             MOVE ZEROS TO W-RIESGOS-PROFE
             CLOSE CONTRATO TABLAEMP
             GO F-LIQUIDA-RIESGOS.

           CLOSE CONTRATO.

           MOVE 051               TO TE051-CODIGO-TABLA
           MOVE AUTOAPOR-CIA-ALT3 TO TE051-CODIGO-EMPRESA
           MOVE CONTRATO-OFICIO      TO TE051-CODIGO-OFICIO
           MOVE ZEROS             TO TE051-CODIGO-FILLER
                                     FIN-ARCH-TABLAEMP.
           PERFORM I-LEE-TABLAEMP-I00 THRU F-LEE-TABLAEMP-I00.
           IF FIN-ARCH-TABLAEMP = 1
             MOVE ZEROS TO W-RIESGOS-PROFE
             CLOSE TABLAEMP
             GO F-LIQUIDA-RIESGOS.
           CLOSE TABLAEMP.

           MOVE TE051-TIP-RIESGO TO TIPO-TARIESGO.
           PERFORM I-LEE-TARIESGO-I00 THRU F-LEE-TARIESGO-I00.
           IF FIN-ARCH-TARIESGO = 1
             MOVE ZEROS TO W-RIESGOS-PROFE
             GO F-LIQUIDA-RIESGOS.

           MOVE ZEROS TO ACINCVAC-VACACI ACINCVAC-INCAPA.
           MOVE ZEROS TO SW-ABRE.
           OPEN INPUT ACINCVAC.
           MOVE 1 TO SW-ABRE.
           IF ACINCVAC-STATUS = "35"
             NEXT SENTENCE
           ELSE
             IF AUTOAPOR-NUMINC-ISS > 0 AND AUTOAPOR-VRBASE > 0
               MOVE AUTOAPOR-CED TO ACINCVAC-CEDULA
               PERFORM I-LEE-ACINCVAC-I00 THRU F-LEE-ACINCVAC-I00
               IF FIN-ARCH-ACINCVAC = 1
                MOVE ZEROS TO ACINCVAC-VACACI ACINCVAC-INCAPA
               END-IF
             END-IF
               CLOSE ACINCVAC.

           COMPUTE W-RIESGOS-PROFE ROUNDED =
            ((AUTOAPOR-VRBASE - ACINCVAC-INCAPA - ACINCVAC-VACACI)
              * PORCEN-TARIESGO / 100).
       F-LIQUIDA-RIESGOS. EXIT.
      *
       I-RIESGO-ANTERIOR.
           MOVE AUTOAPOR-CED TO  ACUMSESO-CEDULA
           PERFORM I-LEE-ACUMSESO-I00  THRU F-LEE-ACUMSESO-I00.
           COMPUTE W-RIESGOS-PROFE  = ACUMSESO-COTARPA.
       F-RIESGO-ANTERIOR. EXIT.
      *
       I-NACIONAL-ISS.
           MOVE "C"                   TO WTEMN786-COSTO.
           MOVE WTEMP786-FUENTE       TO WTEMN786-FUENTE.
           MOVE WTEMP786-CODIGO       TO WTEMN786-CODIGO.

           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRBASE TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
            ADD WA-VLR         TO WTEMN786-BASE.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRAPORTE-SALUD TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMN786-APORTE-SALUD.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-VRAPORTE TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR                  TO WTEMN786-APORTE-PENSI.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-FSP TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMN786-APORTE-FSP.

           MOVE ZEROS TO WA-VLR.
           MOVE AUTOAPOR-APORTE-EMPLEADO TO WA-VLR.
           IF WA-VLR = ZEROS OR WA-VLR = 0202020202
             NEXT SENTENCE
           ELSE
             ADD WA-VLR TO WTEMN786-APORTE-VOLUN.

           ADD W-RIESGOS-PROFE          TO WTEMN786-APORTE-RIESG.

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-NACIONAL-ISS. EXIT.
      *
       I-PROCESO-INCAPACI.
           MOVE ZEROS TO SW-ABRE.
           OPEN INPUT FORMAUTO.
           MOVE 1 TO SW-ABRE.
           IF FORMAUTO-STATUS = "35"
            GO F-PROCESO-INCAPACI.

           MOVE ZEROS TO FORMAUTO-LLAVE.
           PERFORM I-START-FORMAUTO-MAYOR-KEY00 THRU
                   F-START-FORMAUTO-MAYOR-KEY00.
           IF FIN-ARCH-FORMAUTO = 1
             CLOSE FORMAUTO
             GO F-PROCESO-INCAPACI.

           PERFORM I-PROCESO-INCAPACI-INT THRU F-PROCESO-INCAPACI-INT
             UNTIL FIN-ARCH-FORMAUTO = 1.

           CLOSE FORMAUTO.
       F-PROCESO-INCAPACI. EXIT.
      *
       I-PROCESO-INCAPACI-INT.
           PERFORM I-LEE-C-FORMAUTO THRU F-LEE-C-FORMAUTO.
           IF FIN-ARCH-FORMAUTO = 1
            GO F-PROCESO-INCAPACI.
           DISPLAY FORMAUTO-LLAVE LINE 25 POSITION 01.
           PERFORM I-FORMAUTO-WTEMP786 THRU F-FORMAUTO-WTEMP786.
           PERFORM I-FORMAUTO-WTEMN786 THRU F-FORMAUTO-WTEMN786.
       F-PROCESO-INCAPACI-INT. EXIT.
      *
       I-FORMAUTO-WTEMP786.
           MOVE "C"               TO WTEMP786-COSTO.
           MOVE FORMAUTO-SUCURSAL TO WTEMP786-CIUDAD.
           MOVE 1                 TO WTEMP786-FUENTE.
           MOVE 1                 TO WTEMP786-CODIGO.
           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS.

           COMPUTE WTEMP786-DESCUE-INCAP =
             WTEMP786-DESCUE-INCAP +
             FORMAUTO-DOCUM-24A    +
             FORMAUTO-DOCUM-25A    +
             FORMAUTO-DOCUM-25C    +
             FORMAUTO-DOCUM-26C.

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.
       F-FORMAUTO-WTEMP786. EXIT.
      *
       I-FORMAUTO-WTEMN786.
           MOVE "C"               TO WTEMN786-COSTO.
           MOVE 1                 TO WTEMN786-FUENTE.
           MOVE 1                 TO WTEMN786-CODIGO.
           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           COMPUTE WTEMN786-DESCUE-INCAP =
             WTEMN786-DESCUE-INCAP +
             FORMAUTO-DOCUM-24A    +
             FORMAUTO-DOCUM-25A    +
             FORMAUTO-DOCUM-25C    +
             FORMAUTO-DOCUM-26C.

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-FORMAUTO-WTEMN786. EXIT.
      *
       I-PROCESO-FORMUEPS.
           MOVE ZEROS TO SW-ABRE.
           OPEN INPUT FORMUEPS.
           MOVE 1 TO SW-ABRE.
           IF FORMUEPS-STATUS = "35"
            GO F-PROCESO-FORMUEPS.

           MOVE ZEROS TO FORMUEPS-LLAVE-00.
           PERFORM I-START-FORMUEPS-MAYOR-KEY00 THRU
                   F-START-FORMUEPS-MAYOR-KEY00.
           IF FIN-ARCH-FORMUEPS = 1
             CLOSE FORMUEPS
             GO F-PROCESO-FORMUEPS.

           PERFORM I-PROCESO-FORMUEPS-INT THRU F-PROCESO-FORMUEPS-INT
             UNTIL FIN-ARCH-FORMUEPS = 1.

           CLOSE FORMUEPS.
       F-PROCESO-FORMUEPS. EXIT.
      *
       I-PROCESO-FORMUEPS-INT.
           PERFORM I-LEE-C-FORMUEPS THRU F-LEE-C-FORMUEPS.
           IF FIN-ARCH-FORMUEPS = 1
            GO F-PROCESO-FORMUEPS.
           DISPLAY FORMUEPS-LLAVE-00 LINE 25 POSITION 01.
           PERFORM I-FORMUEPS-WTEMP786 THRU F-FORMUEPS-WTEMP786.
           PERFORM I-FORMUEPS-WTEMN786 THRU F-FORMUEPS-WTEMN786.
       F-PROCESO-FORMUEPS-INT. EXIT.
      *
       I-FORMUEPS-WTEMP786.
           MOVE "C"               TO WTEMP786-COSTO.
           MOVE 1                 TO WTEMP786-CIUDAD.
           MOVE 3                 TO WTEMP786-FUENTE.
           MOVE FORMUEPS-EPS      TO WTEMP786-CODIGO.
           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS.

           COMPUTE WTEMP786-DESCUE-INCAP =
             WTEMP786-DESCUE-INCAP +
             FORMUEPS-INCA-EG      +
             FORMUEPS-INCA-M.

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.
       F-FORMUEPS-WTEMP786. EXIT.
      *
       I-FORMUEPS-WTEMN786.
           MOVE "C"               TO WTEMN786-COSTO.
           MOVE 3                 TO WTEMN786-FUENTE.
           MOVE FORMUEPS-EPS      TO WTEMN786-CODIGO.
           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           COMPUTE WTEMN786-DESCUE-INCAP =
             WTEMN786-DESCUE-INCAP +
             FORMUEPS-INCA-EG      +
             FORMUEPS-INCA-M.

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-FORMUEPS-WTEMN786. EXIT.
      *
       I-REGRABA-WTEMN786.
           PERFORM I-WTEMN786-REWRITE THRU F-WTEMN786-REWRITE.
           IF FIN-ARCH-WTEMN786 = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             "NO REGRABA WTEMN786 OJO... " LINE 25 POSITION 01
             PERFORM ACEPTA-TRUCO.
       F-REGRABA-WTEMN786. EXIT.
      *
       I-GRABA-WTEMN786.
           PERFORM I-WTEMN786-WRITE THRU F-WTEMN786-WRITE.
           IF FIN-ARCH-WTEMN786 = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             "NO GRABA WTEMN786 OJO... " LINE 25 POSITION 01
             PERFORM ACEPTA-TRUCO.
       F-GRABA-WTEMN786. EXIT.
      *
       I-PROCESO-AFP.
           MOVE ZEROS TO FONPENSI-CLAVE.
           PERFORM I-START-FONPENSI-MAYOR-KEY00 THRU
                   F-START-FONPENSI-MAYOR-KEY00.
           IF FIN-ARCH-FONPENSI = 1
             GO F-PROCESO-AFP.
           PERFORM I-PROCESO-AFP-INT THRU F-PROCESO-AFP-INT
             UNTIL FIN-ARCH-FONPENSI = 1.
       F-PROCESO-AFP. EXIT.
      *
       I-PROCESO-AFP-INT.
           PERFORM I-LEE-C-FONPENSI THRU F-LEE-C-FONPENSI.
           IF FIN-ARCH-FONPENSI = 1
             GO F-PROCESO-AFP-INT.
           DISPLAY FONPENSI-CLAVE LINE 25 POSITION 01.
           PERFORM I-FONPENSI-WTEMP786 THRU F-FONPENSI-WTEMP786.
       F-PROCESO-AFP-INT. EXIT.
      *
       I-FONPENSI-WTEMP786.
           IF FONPENSI-FON = 1
             GO F-FONPENSI-WTEMP786.

           IF FONPENSI-CIA-ALT3 =   1 OR
              FONPENSI-CIA-ALT3 = 301 OR
              FONPENSI-CIA-ALT3 = 302 OR
              FONPENSI-CIA-ALT3 = 303
             MOVE "G" TO WTEMP786-COSTO
           ELSE
             MOVE "C" TO WTEMP786-COSTO.

           MOVE 2 TO WTEMP786-FUENTE.

           MOVE FONPENSI-CIA-ALT3 TO WIN-CODIGO-EMPRESA.
           PERFORM I-LEE-EMPRESAS-I00 THRU F-LEE-EMPRESAS-I00.
           IF FIN-ARCH-EMPRESAS = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " EMPRESA NO EXISTE "  LINE 25 POSITION 01
             WIN-CODIGO-EMPRESA     LINE 25 POSITION 21
             PERFORM ACEPTA-TRUCO
             GO F-FONPENSI-WTEMP786.

           MOVE WIN-COD-CIUDAD TO WTEMP786-CIUDAD.
      *NJ  IF WTEMP786-CIUDAD > 50
      *NJ    COMPUTE WTEMP786-CIUDAD = WTEMP786-CIUDAD - 50.

           MOVE FONPENSI-FON TO WTEMP786-CODIGO.

           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
                   WTEMP786-LLAVE-00 LINE 25 POSITION 01

           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS.

           ADD FONPENSI-VRBASE TO WTEMP786-BASE

           ADD FONPENSI-VRAPORTE TO WTEMP786-APORTE-PENSI

           ADD FONPENSI-FSP TO WTEMP786-APORTE-FSP

           ADD FONPENSI-APORTE-EMPLEADO TO WTEMP786-APORTE-VOLUN.

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.

           DISPLAY WTEMP786-LLAVE-00   LINE 25 POSITION 01.
           PERFORM I-NACIONAL-AFP THRU F-NACIONAL-AFP.
       F-FONPENSI-WTEMP786. EXIT.
      *
       I-NACIONAL-AFP.
           MOVE "C"                   TO WTEMN786-COSTO.
           MOVE WTEMP786-FUENTE       TO WTEMN786-FUENTE.
           MOVE WTEMP786-CODIGO       TO WTEMN786-CODIGO.

           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           ADD FONPENSI-VRBASE          TO WTEMN786-BASE

           ADD FONPENSI-VRAPORTE        TO WTEMN786-APORTE-PENSI

           ADD FONPENSI-FSP             TO WTEMN786-APORTE-FSP

           ADD FONPENSI-APORTE-EMPLEADO TO WTEMN786-APORTE-VOLUN.

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-NACIONAL-AFP. EXIT.
      *
       I-PROCESO-EPS.
           MOVE ZEROS TO EPSLIQUI-CLAVE.
           PERFORM I-START-EPSLIQUI-MAYOR-KEY00 THRU
                   F-START-EPSLIQUI-MAYOR-KEY00.
           IF FIN-ARCH-EPSLIQUI = 1
              GO F-PROCESO-EPS.
           PERFORM I-PROCESO-EPS-INT THRU F-PROCESO-EPS-INT
                   UNTIL FIN-ARCH-EPSLIQUI = 1.
       F-PROCESO-EPS. EXIT.
      *
       I-PROCESO-EPS-INT.
           PERFORM I-LEE-C-EPSLIQUI THRU F-LEE-C-EPSLIQUI.
           IF FIN-ARCH-EPSLIQUI = 1
             GO F-PROCESO-EPS-INT.
           DISPLAY EPSLIQUI-CLAVE LINE 25 POSITION 01.
           PERFORM I-EPSLIQUI-WTEMP786 THRU F-EPSLIQUI-WTEMP786.
       F-PROCESO-EPS-INT. EXIT.
      *
       I-EPSLIQUI-WTEMP786.
           IF EPSLIQUI-EPS = 1
             GO F-EPSLIQUI-WTEMP786.

           IF EPSLIQUI-CIA-ALT3 =   1 OR
              EPSLIQUI-CIA-ALT3 = 301 OR
              EPSLIQUI-CIA-ALT3 = 302 OR
              EPSLIQUI-CIA-ALT3 = 303
             MOVE "G" TO WTEMP786-COSTO
           ELSE
             MOVE "C" TO WTEMP786-COSTO.

           MOVE 3 TO WTEMP786-FUENTE.

           MOVE EPSLIQUI-CIA-ALT3 TO WIN-CODIGO-EMPRESA.
           PERFORM I-LEE-EMPRESAS-I00 THRU F-LEE-EMPRESAS-I00.
           IF FIN-ARCH-EMPRESAS = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " EMPRESA NO EXISTE "  LINE 25 POSITION 01
             WIN-CODIGO-EMPRESA     LINE 25 POSITION 21
             PERFORM ACEPTA-TRUCO
             GO F-EPSLIQUI-WTEMP786.

           MOVE WIN-COD-CIUDAD TO WTEMP786-CIUDAD.
      *NJ  IF WTEMP786-CIUDAD > 50
      *NJ    COMPUTE WTEMP786-CIUDAD = WTEMP786-CIUDAD - 50.

           MOVE EPSLIQUI-EPS TO WTEMP786-CODIGO.

           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
                   WTEMP786-LLAVE-00 LINE 25 POSITION 01

           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS.

           ADD EPSLIQUI-VRBASE TO WTEMP786-BASE

           ADD EPSLIQUI-VRAPORTE TO WTEMP786-APORTE-SALUD

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.

           DISPLAY WTEMP786-LLAVE-00   LINE 25 POSITION 01.

           PERFORM I-NACIONAL-EPS THRU F-NACIONAL-EPS.
       F-EPSLIQUI-WTEMP786. EXIT.
      *
       I-NACIONAL-EPS.
           MOVE "C"                   TO WTEMN786-COSTO.
           MOVE WTEMP786-FUENTE       TO WTEMN786-FUENTE.
           MOVE WTEMP786-CODIGO       TO WTEMN786-CODIGO.

           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           ADD EPSLIQUI-VRBASE TO WTEMN786-BASE

           ADD EPSLIQUI-VRAPORTE TO WTEMN786-APORTE-SALUD

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-NACIONAL-EPS. EXIT.
      *
       I-PROCESO-CAJAS.
           MOVE ZEROS TO CAJACOLT-CAJACO
                         CAJACOLT-EMPRES.
           MOVE SPACE TO CAJACOLT-SEGURO.
           PERFORM I-START-CAJACOLT-MAYOR-KEY00 THRU
                   F-START-CAJACOLT-MAYOR-KEY00.
           IF FIN-ARCH-CAJACOLT = 1
             GO F-PROCESO-CAJAS.
           PERFORM I-PROCESO-CAJAS-INT THRU F-PROCESO-CAJAS-INT
             UNTIL FIN-ARCH-CAJACOLT = 1.
       F-PROCESO-CAJAS. EXIT.
      *
       I-PROCESO-CAJAS-INT.
           PERFORM I-LEE-C-CAJACOLT THRU F-LEE-C-CAJACOLT.
           IF FIN-ARCH-CAJACOLT = 1
             GO F-PROCESO-CAJAS-INT.
           IF CAJACOLT-CAJACO = 99
             GO F-PROCESO-CAJAS-INT.
           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
           DISPLAY CAJACOLT-LLAVE LINE 25 POSITION 01
           PERFORM I-CAJACOLT-WTEMP786 THRU F-CAJACOLT-WTEMP786.
       F-PROCESO-CAJAS-INT. EXIT.
      *
       I-CAJACOLT-WTEMP786.
           IF CAJACOLT-EMPRES =   1 OR
              CAJACOLT-EMPRES = 301 OR
              CAJACOLT-EMPRES = 302 OR
              CAJACOLT-EMPRES = 303
             MOVE "G" TO WTEMP786-COSTO
           ELSE
             MOVE "C" TO WTEMP786-COSTO.

           MOVE 4 TO WTEMP786-FUENTE.

           MOVE CAJACOLT-EMPRES TO WIN-CODIGO-EMPRESA.
           PERFORM I-LEE-EMPRESAS-I00 THRU F-LEE-EMPRESAS-I00.
           IF FIN-ARCH-EMPRESAS = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             " EMPRESA NO EXISTE "  LINE 25 POSITION 01
             WIN-CODIGO-EMPRESA     LINE 25 POSITION 21
             PERFORM ACEPTA-TRUCO
             GO F-CAJACOLT-WTEMP786.

           MOVE WIN-COD-CIUDAD TO WTEMP786-CIUDAD.
      *NJ  IF WTEMP786-CIUDAD > 50
      *NJ    COMPUTE WTEMP786-CIUDAD = WTEMP786-CIUDAD - 50.

           MOVE CAJACOLT-CAJACO TO WTEMP786-CODIGO.

           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
                   WTEMP786-LLAVE-00 LINE 25 POSITION 01

           PERFORM I-LEE-WTEMP786-I00 THRU F-LEE-WTEMP786-I00.
           IF FIN-ARCH-WTEMP786 = 1
             MOVE ZEROS TO WTEMP786-DATOS.

           ADD CAJACOLT-BASE TO WTEMP786-BASE

           ADD CAJACOLT-ICBF TO WTEMP786-CAJAS-ICBF

           ADD CAJACOLT-SENA TO WTEMP786-CAJAS-SENA

           ADD CAJACOLT-SUFA TO WTEMP786-CAJAS-SUFA

           ADD CAJACOLT-TOTA TO WTEMP786-CAJAS-TOTA

           IF FIN-ARCH-WTEMP786 = 1
            PERFORM I-GRABA-WTEMP786 THRU F-GRABA-WTEMP786
           ELSE
            PERFORM I-REGRABA-WTEMP786 THRU F-REGRABA-WTEMP786.

           DISPLAY WTEMP786-LLAVE-00   LINE 25 POSITION 01.

           PERFORM I-NACIONAL-CAJAS THRU F-NACIONAL-CAJAS.
       F-CAJACOLT-WTEMP786. EXIT.
      *
       I-NACIONAL-CAJAS.
           MOVE "C"                   TO WTEMN786-COSTO.
           MOVE WTEMP786-FUENTE       TO WTEMN786-FUENTE.
           MOVE WTEMP786-CODIGO       TO WTEMN786-CODIGO.

           PERFORM I-LEE-WTEMN786-I00 THRU F-LEE-WTEMN786-I00.
           IF FIN-ARCH-WTEMN786 = 1
             MOVE ZEROS TO WTEMN786-DATOS.

           ADD CAJACOLT-BASE TO WTEMN786-BASE

           ADD CAJACOLT-ICBF TO WTEMN786-CAJAS-ICBF

           ADD CAJACOLT-SENA TO WTEMN786-CAJAS-SENA

           ADD CAJACOLT-SUFA TO WTEMN786-CAJAS-SUFA

           ADD CAJACOLT-TOTA TO WTEMN786-CAJAS-TOTA

           IF FIN-ARCH-WTEMN786 = 1
            PERFORM I-GRABA-WTEMN786 THRU F-GRABA-WTEMN786
           ELSE
            PERFORM I-REGRABA-WTEMN786 THRU F-REGRABA-WTEMN786.
       F-NACIONAL-CAJAS. EXIT.
      *
       I-REGRABA-WTEMP786.
           PERFORM I-WTEMP786-REWRITE THRU F-WTEMP786-REWRITE.
           IF FIN-ARCH-WTEMP786 = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             "NO REGRABA WTEMP786 OJO... " LINE 25 POSITION 01
             PERFORM ACEPTA-TRUCO.
       F-REGRABA-WTEMP786. EXIT.
      *
       I-GRABA-WTEMP786.
           PERFORM I-WTEMP786-WRITE THRU F-WTEMP786-WRITE.
           IF FIN-ARCH-WTEMP786 = 1
             DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
             "NO GRABA WTEMP786 OJO... " LINE 25 POSITION 01
             PERFORM ACEPTA-TRUCO.
       F-GRABA-WTEMP786. EXIT.
      *
       I-PROCESO-INFORME.
           MOVE SPACE TO WTEMP786-COSTO.
           MOVE ZEROS TO WTEMP786-FUENTE
                         WTEMP786-CODIGO.
           PERFORM I-START-WTEMP786-MAYOR-KEY00 THRU
                   F-START-WTEMP786-MAYOR-KEY00.
           IF FIN-ARCH-WTEMP786 = 1
             GO F-PROCESO-INFORME.
           PERFORM I-PROCESO-INFORME-INT THRU F-PROCESO-INFORME-INT
             UNTIL FIN-ARCH-WTEMP786 = 1.
           PERFORM I-TOTAL-CIUDAD THRU F-TOTAL-CIUDAD.
           PERFORM I-TOTAL-COSTO  THRU F-TOTAL-COSTO.
           PERFORM I-TOTAL-TOTAL  THRU F-TOTAL-TOTAL.
       F-PROCESO-INFORME. EXIT.
      *
       I-TOTAL-TOTAL.
           MOVE "TOTAL GENERAL" TO ID-ENTIDA.
           MOVE ZEROS        TO ID-BASE.
           MOVE W-TOTA-SALUP TO ID-SALUP.
           MOVE W-TOTA-SALUE TO ID-SALUE.
           MOVE W-TOTA-SALUD TO ID-SALUD.
           MOVE W-TOTA-PENSP TO ID-PENSP.
           MOVE W-TOTA-PENSE TO ID-PENSE.
           MOVE W-TOTA-PENSI TO ID-PENSI.
           MOVE W-TOTA-FSP   TO ID-FSP.
           MOVE W-TOTA-VOLUN TO ID-VOLUN.
           MOVE W-TOTA-RIESG TO ID-RIESG.
           MOVE W-TOTA-INCAP TO ID-INCAP.
           MOVE W-TOTA-ICBF  TO ID-ICBF.
           MOVE W-TOTA-SENA  TO ID-SENA.
           MOVE W-TOTA-SUFA  TO ID-SUFA.
           MOVE W-TOTA-TOTA  TO ID-TOTA.
           MOVE W-TOTA-PATR  TO ID-PATR.
           MOVE W-TOTA-EMPL  TO ID-EMPL.
           MOVE W-TOTA-COTI  TO ID-COTI.
           MOVE W-TOTA-PAGA  TO ID-PAGA.
           MOVE W-TOTA-SUB1  TO ID-SUB1.
           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           WRITE REG-INFORMES FROM I-DETALLE AFTER 1.
           ADD 1 TO WK-LINEAS.
           WRITE REG-LISTADOS FROM I-DETALLE AFTER 1.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.
       F-TOTAL-TOTAL. EXIT.
      *
       I-PROCESO-INFORME-INT.
           PERFORM I-LEE-C-WTEMP786 THRU F-LEE-C-WTEMP786.
           IF FIN-ARCH-WTEMP786 = 1
             GO F-PROCESO-INFORME-INT.

           IF W-CIUDAD NOT = WTEMP786-CIUDAD
             IF W-CIUDAD NOT = ZEROS
              PERFORM I-TOTAL-CIUDAD THRU F-TOTAL-CIUDAD
              MOVE ZEROS TO W-ACUM-CIUD
             END-IF.

           IF W-COSTO NOT = WTEMP786-COSTO
             IF W-COSTO NOT = SPACE
               PERFORM I-TOTAL-COSTO  THRU F-TOTAL-COSTO
               MOVE 60 TO WK-LINEAS
               MOVE ZEROS TO W-ACUM-COST
             END-IF
             MOVE WTEMP786-COSTO TO W-COSTO.

           IF W-CIUDAD NOT = WTEMP786-CIUDAD
             MOVE WTEMP786-CIUDAD TO W-CIUDAD
             PERFORM I-ROMPE-CIUDAD THRU F-ROMPE-CIUDAD.

           DISPLAY WTEMP786-LLAVE-00 LINE 25 POSITION 01.
           PERFORM I-ACUMULADOS THRU F-ACUMULADOS.
           PERFORM I-WTEMP786-INFORME THRU F-WTEMP786-INFORME.
       F-PROCESO-INFORME-INT. EXIT.
      *
       I-TOTAL-COSTO.
           IF W-COSTO = "C"
             MOVE "TOTAL COSTO" TO ID-ENTIDA
           ELSE
             MOVE "TOTAL GASTO" TO ID-ENTIDA.
           MOVE ZEROS        TO ID-BASE.
           MOVE W-COST-SALUP TO ID-SALUP.
           MOVE W-COST-SALUE TO ID-SALUE.
           MOVE W-COST-SALUD TO ID-SALUD.
           MOVE W-COST-PENSP TO ID-PENSP.
           MOVE W-COST-PENSE TO ID-PENSE.
           MOVE W-COST-PENSI TO ID-PENSI.
           MOVE W-COST-FSP   TO ID-FSP.
           MOVE W-COST-VOLUN TO ID-VOLUN.
           MOVE W-COST-RIESG TO ID-RIESG.
           MOVE W-COST-INCAP TO ID-INCAP.
           MOVE W-COST-ICBF  TO ID-ICBF.
           MOVE W-COST-SENA  TO ID-SENA.
           MOVE W-COST-SUFA  TO ID-SUFA.
           MOVE W-COST-TOTA  TO ID-TOTA.
           MOVE W-COST-PATR  TO ID-PATR.
           MOVE W-COST-EMPL  TO ID-EMPL.
           MOVE W-COST-COTI  TO ID-COTI.
           MOVE W-COST-PAGA  TO ID-PAGA.
           MOVE W-COST-SUB1  TO ID-SUB1.
           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           WRITE REG-INFORMES FROM I-DETALLE AFTER 1.
           ADD 1 TO WK-LINEAS.
           WRITE REG-LISTADOS FROM I-DETALLE AFTER 1.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.
       F-TOTAL-COSTO. EXIT.
      *
       I-ACUMULADOS.
           ADD WTEMP786-APORTE-SALUD TO W-CIUD-SALUD
                                        W-COST-SALUD
                                        W-TOTA-SALUD
           ADD WTEMP786-APORTE-PENSI TO W-CIUD-PENSI
                                        W-COST-PENSI
                                        W-TOTA-PENSI
           ADD WTEMP786-APORTE-FSP   TO W-CIUD-FSP
                                        W-COST-FSP
                                        W-TOTA-FSP
           ADD WTEMP786-APORTE-VOLUN TO W-CIUD-VOLUN
                                        W-COST-VOLUN
                                        W-TOTA-VOLUN
           ADD WTEMP786-APORTE-RIESG TO W-CIUD-RIESG
                                        W-COST-RIESG
                                        W-TOTA-RIESG
           ADD WTEMP786-DESCUE-INCAP TO W-CIUD-INCAP
                                        W-COST-INCAP
                                        W-TOTA-INCAP
           ADD WTEMP786-CAJAS-ICBF   TO W-CIUD-ICBF
                                        W-COST-ICBF
                                        W-TOTA-ICBF
           ADD WTEMP786-CAJAS-SENA   TO W-CIUD-SENA
                                        W-COST-SENA
                                        W-TOTA-SENA
           ADD WTEMP786-CAJAS-SUFA   TO W-CIUD-SUFA
                                        W-COST-SUFA
                                        W-TOTA-SUFA
           ADD WTEMP786-CAJAS-TOTA   TO W-CIUD-TOTA
                                        W-COST-TOTA
                                        W-TOTA-TOTA.
       F-ACUMULADOS. EXIT.
      *
       I-TOTAL-CIUDAD.
           MOVE  ZEROS       TO  LEIDOS.
           IF   IND-SW = 1
                ADD   1      TO  W-DIA-HASTA.
      *NJ  MOVE "TOTAL CIUDAD" TO ID-ENTIDA.
           MOVE WK-ENTIDAD   TO ID-ENTIDA.
           MOVE ZEROS        TO ID-BASE
           MOVE W-CIUD-SALUP TO ID-SALUP.
           MOVE W-CIUD-SALUE TO ID-SALUE.
           MOVE W-CIUD-SALUD TO ID-SALUD.
           MOVE W-CIUD-PENSE TO ID-PENSE.
           MOVE W-CIUD-PENSP TO ID-PENSP.
           MOVE W-CIUD-PENSI TO ID-PENSI.
           MOVE W-CIUD-FSP   TO ID-FSP.
           MOVE W-CIUD-VOLUN TO ID-VOLUN.
           MOVE W-CIUD-RIESG TO ID-RIESG.
           MOVE W-CIUD-INCAP TO ID-INCAP.
           MOVE W-CIUD-ICBF  TO ID-ICBF.
           MOVE W-CIUD-SENA  TO ID-SENA.
           MOVE W-CIUD-SUFA  TO ID-SUFA.
           MOVE W-CIUD-TOTA  TO ID-TOTA.
           MOVE W-CIUD-PATR  TO ID-PATR.
           MOVE W-CIUD-EMPL  TO ID-EMPL.
           MOVE W-CIUD-COTI  TO ID-COTI.
           MOVE W-CIUD-PAGA  TO ID-PAGA.
           MOVE W-CIUD-SUB1  TO ID-SUB1.
           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           WRITE REG-INFORMES FROM I-DETALLE AFTER 1.
           ADD 1 TO WK-LINEAS.
           WRITE REG-LISTADOS FROM I-DETALLE AFTER 1.

           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           MOVE SPACES TO REG-INFORMES.
           WRITE REG-INFORMES AFTER 1.
           ADD 1 TO WK-LINEAS.
       F-TOTAL-CIUDAD. EXIT.
      *
       I-ROMPE-CIUDAD.
           MOVE W-CIUDAD TO CIUD-CODIGO.
           PERFORM I-LEE-NOMICIUD-I00 THRU F-LEE-NOMICIUD-I00.
           IF FIN-ARCH-NOMICIUD = 1
             MOVE "N.N." TO CIUD-NOMBRE.
           MOVE CIUD-NOMBRE TO IT04-CIUDAD K-CIUDAD.
           PERFORM I-TITULOS-INFORMES THRU F-TITULOS-INFORMES.
           WRITE REG-INFORMES FROM I-TITULO-4 AFTER 1.
           WRITE REG-INFORMES FROM I-TITULO-4 AFTER 0.
           ADD 1 TO WK-LINEAS.
       F-ROMPE-CIUDAD. EXIT.
      *
       I-TITULOS-INFORMES.
           IF WK-LINEAS = 0 OR WK-LINEAS > 57
            NEXT SENTENCE
           ELSE
            GO F-TITULOS-INFORMES.

           PERFORM I-VARINFOR-INCA1478 THRU F-VARINFOR-INCA1478.
           MOVE I-TITULO-01 TO E14-03-DESINF.
           MOVE I-TITULO-02 TO E14-07-TITU.
           MOVE I-TITULO-05 TO E14-08-TITU.

           IF W-COSTO = "C" OR W-COSTO = " "
            MOVE "COSTOS" TO IT03-COSTO
           ELSE
            MOVE "GASTOS" TO IT03-COSTO.
           MOVE I-TITULO-3 TO E14-02-DESINF.

           ADD 1 TO WK-PAGINA.
           MOVE WK-PAGINA TO ENC14-PAGINA.
           PERFORM I-INFORMES-INCA1478 THRU F-INFORMES-INCA1478.
           MOVE 9 TO WK-LINEAS.
       F-TITULOS-INFORMES. EXIT.
      * Nayibe
       I-WTEMP786-INFORME.
           MOVE ZEROS TO W-ACUM-LINE.
           PERFORM I-TRAER-ENTIDAD THRU F-TRAER-ENTIDAD.
           MOVE WTEMP786-BASE        TO ID-BASE.
           MOVE ZEROS TO W-AUXE-CALCULO
                         W-AUXP-CALCULO.
           MOVE ZEROS TO W-TOTAL  VR-APLICA W-SUBTOT VR-HORAS.
           COMPUTE W-AUXE-CALCULO ROUNDED =
             WTEMP786-APORTE-SALUD * 0.3333333333.
           ADD W-AUXE-CALCULO TO W-CIUD-SALUE
                                 W-COST-SALUE
                                 W-TOTA-SALUE
                                 W-LINE-EMPL.
           MOVE W-AUXE-CALCULO TO ID-SALUE VR-APLICA
           COMPUTE W-AUXP-CALCULO =
             WTEMP786-APORTE-SALUD - W-AUXE-CALCULO.
           MOVE W-AUXP-CALCULO TO ID-SALUP W-SUBTOT.
           ADD W-AUXP-CALCULO  TO W-CIUD-SALUP
                                  W-COST-SALUP
                                  W-TOTA-SALUP
                                  W-LINE-PATR.
           MOVE WTEMP786-APORTE-SALUD TO ID-SALUD.

           MOVE WTEMP786-APORTE-PENSI TO ID-PENSI.
           MOVE ZEROS TO W-AUXE-CALCULO
                         W-AUXP-CALCULO.
           COMPUTE W-AUXE-CALCULO ROUNDED =
             WTEMP786-APORTE-PENSI * 0.2496296296.
           ADD W-AUXE-CALCULO TO W-CIUD-PENSE
                                 W-COST-PENSE
                                 W-TOTA-PENSE
                                 W-LINE-EMPL.
           MOVE W-AUXE-CALCULO TO ID-PENSE.
           COMPUTE W-AUXP-CALCULO =
             WTEMP786-APORTE-PENSI - W-AUXE-CALCULO.
           ADD W-AUXP-CALCULO TO W-CIUD-PENSP
                                 W-COST-PENSP
                                 W-TOTA-PENSP
                                 W-LINE-PATR.
           MOVE W-AUXP-CALCULO       TO ID-PENSP.

           MOVE WTEMP786-APORTE-FSP   TO ID-FSP.
           ADD WTEMP786-APORTE-FSP TO W-LINE-EMPL.

           MOVE WTEMP786-APORTE-VOLUN TO ID-VOLUN.
           ADD WTEMP786-APORTE-VOLUN  TO W-LINE-EMPL.

           COMPUTE W-TOTAL =  W-AUXE-CALCULO + WTEMP786-APORTE-FSP +
                              WTEMP786-APORTE-VOLUN.

           MOVE WTEMP786-APORTE-RIESG TO ID-RIESG.
           ADD WTEMP786-APORTE-RIESG  TO W-LINE-PATR.

           MOVE WTEMP786-DESCUE-INCAP TO ID-INCAP.

           MOVE WTEMP786-CAJAS-ICBF   TO ID-ICBF.
           MOVE WTEMP786-CAJAS-SENA   TO ID-SENA.
           MOVE WTEMP786-CAJAS-SUFA   TO ID-SUFA.
           MOVE WTEMP786-CAJAS-TOTA   TO ID-TOTA.
           IF WTEMP786-FUENTE = 4
           COMPUTE VR-HORAS =  WTEMP786-CAJAS-ICBF + WTEMP786-CAJAS-SENA
                            +  WTEMP786-CAJAS-SUFA.
           COMPUTE W-LINE-COTI = W-LINE-EMPL + W-LINE-PATR.

           MOVE ZEROS TO W-LINE-SUB1.
           COMPUTE W-LINE-SUB1 = W-LINE-COTI - WTEMP786-DESCUE-INCAP.
           MOVE W-LINE-SUB1 TO ID-SUB1.
           ADD  W-LINE-SUB1 TO W-CIUD-SUB1
                               W-COST-SUB1
                               W-TOTA-SUB1.
           IF WTEMP786-FUENTE = 4
              COMPUTE W-LINE-PAGA = W-LINE-SUB1 +
                                    VR-HORAS
           ELSE
              COMPUTE W-LINE-PAGA = W-LINE-SUB1 +
                                    WTEMP786-CAJAS-TOTA.
           MOVE W-LINE-PATR TO ID-PATR.
           MOVE W-LINE-EMPL TO ID-EMPL.
           MOVE W-LINE-COTI TO ID-COTI.
           MOVE W-LINE-PAGA TO ID-PAGA.
           ADD W-LINE-PATR TO W-CIUD-PATR
                              W-COST-PATR
                              W-TOTA-PATR.
           ADD W-LINE-EMPL TO W-CIUD-EMPL
                              W-COST-EMPL
                              W-TOTA-EMPL.
           ADD W-LINE-COTI TO W-CIUD-COTI
                              W-COST-COTI
                              W-TOTA-COTI.
           ADD W-LINE-PAGA TO W-CIUD-PAGA
                              W-COST-PAGA
                              W-TOTA-PAGA.

           PERFORM I-TITULOS-INFORMES      THRU F-TITULOS-INFORMES.
           WRITE REG-INFORMES              FROM I-DETALLE AFTER 1.
           ADD 1 TO WK-LINEAS.
           PERFORM I-CONTABILIZA-MVDOCTOS  THRU F-CONTABILIZA-MVDOCTOS.
       F-WTEMP786-INFORME. EXIT.
      *
       I-TRAER-ENTIDAD.
           IF WTEMP786-FUENTE = 1 OR
              WTEMP786-FUENTE = 2
             PERFORM I-ENTIDAD-AFP THRU F-ENTIDAD-AFP.

           IF WTEMP786-FUENTE = 3
             PERFORM I-ENTIDAD-EPS THRU F-ENTIDAD-EPS.

           IF WTEMP786-FUENTE = 4
             PERFORM I-ENTIDAD-CAJ THRU F-ENTIDAD-CAJ.
       F-TRAER-ENTIDAD. EXIT.
      *
       I-ENTIDAD-CAJ.
           MOVE WTEMP786-CODIGO TO COD-CJASUBSI.
           PERFORM I-LEE-CJASUBSI-I00 THRU F-LEE-CJASUBSI-I00.
           MOVE NIT-CJASUBSI            TO WK-NIT.
           IF FIN-ARCH-CJASUBSI = 1
             MOVE "N.N." TO NOM-CJASUBSI.
           MOVE NOM-CJASUBSI TO ID-ENTIDA.
       F-ENTIDAD-CAJ. EXIT.
      *
       I-ENTIDAD-EPS.
           MOVE WTEMP786-CODIGO TO COD-PROMSALU.
           PERFORM I-LEE-PROMSALU-I00 THRU F-LEE-PROMSALU-I00.
           MOVE NIT-PROMSALU            TO WK-NIT.
           IF FIN-ARCH-PROMSALU = 1
             MOVE "N.N." TO NOM-PROMSALU.
           MOVE NOM-PROMSALU TO ID-ENTIDA.
       F-ENTIDAD-EPS. EXIT.
      *
       I-ENTIDAD-AFP.
           MOVE WTEMP786-CODIGO TO COD-FPENSION.
           PERFORM I-LEE-FPENSION-I00 THRU F-LEE-FPENSION-I00.
           MOVE NIT-FPENSION            TO WK-NIT.
           IF FIN-ARCH-FPENSION = 1
             MOVE "N.N." TO NOM-FPENSION.
           MOVE NOM-FPENSION TO ID-ENTIDA.
       F-ENTIDAD-AFP. EXIT.
      *
       I-PROCESO-REPORTE.
           MOVE ZEROS  TO W-ACUM-TOTA.
           MOVE SPACES TO WTEMN786-COSTO.
           MOVE ZEROS  TO WTEMN786-FUENTE
                          WTEMN786-CODIGO.
           PERFORM I-START-WTEMN786-MAYOR-KEY00 THRU
                   F-START-WTEMN786-MAYOR-KEY00.
           IF FIN-ARCH-WTEMN786 = 1
             GO F-PROCESO-REPORTE.
           PERFORM I-PROCESO-REPORTE-INT THRU F-PROCESO-REPORTE-INT
             UNTIL FIN-ARCH-WTEMN786 = 1.
           PERFORM I-TOTAL-TOTALR THRU F-TOTAL-TOTALR.
       F-PROCESO-REPORTE. EXIT.
      *
       I-TOTAL-TOTALR.
           MOVE "TOTAL GENERAL" TO RD-ENTIDA.
      *NJ  MOVE ZEROS        TO RD-BASE.
           MOVE ZEROS        TO RD-SALUP.
           MOVE W-TOTA-SALUE TO RD-SALUE.
           MOVE ZEROS        TO RD-APORTE-SALUD.
           MOVE W-TOTA-PENSP TO RD-PENSP.
           MOVE ZEROS        TO RD-PENSE.
           MOVE W-TOTA-PENSI TO RD-APORTE-PENSI.
           MOVE ZEROS        TO RD-APORTE-FSP.
           MOVE W-TOTA-VOLUN TO RD-APORTE-VOLUN.
           MOVE ZEROS        TO RD-APORTE-RIESG.
           MOVE W-TOTA-INCAP TO RD-DESCUE-INCAP.
           MOVE ZEROS        TO RD-ICBF.
           MOVE W-TOTA-SENA  TO RD-SENA.
           MOVE ZEROS        TO RD-SUFA.
           MOVE W-TOTA-TOTA  TO RD-TOTA.
           MOVE ZEROS        TO RD-PATR.
           MOVE W-TOTA-EMPL  TO RD-EMPL.
           MOVE ZEROS        TO RD-COTI.
           MOVE W-TOTA-PAGA  TO RD-PAGA.
           MOVE ZEROS        TO RD-SUB1.
           PERFORM I-TITULOS-REPORTES THRU F-TITULOS-REPORTES.
           WRITE REG-REPORTES FROM I-TITULO-06 AFTER 1.
           ADD 1 TO W-LINEAS-R.

           PERFORM I-TITULOS-REPORTES THRU F-TITULOS-REPORTES.
           WRITE REG-REPORTES FROM R-DETALLE AFTER 1.
           ADD 1 TO W-LINEAS-R.

           MOVE "TOTAL GENERAL" TO RD-ENTIDA.
      *NJ  MOVE ZEROS        TO RD-BASE.
           MOVE W-TOTA-SALUP TO RD-SALUP.
           MOVE ZEROS        TO RD-SALUE.
           MOVE W-TOTA-SALUD TO RD-APORTE-SALUD.
           MOVE ZEROS        TO RD-PENSP.
           MOVE W-TOTA-PENSE TO RD-PENSE.
           MOVE ZEROS        TO RD-APORTE-PENSI.
           MOVE W-TOTA-FSP   TO RD-APORTE-FSP.
           MOVE ZEROS        TO RD-APORTE-VOLUN.
           MOVE W-TOTA-RIESG TO RD-APORTE-RIESG.
           MOVE ZEROS        TO RD-DESCUE-INCAP.
           MOVE W-TOTA-ICBF  TO RD-ICBF.
           MOVE ZEROS        TO RD-SENA.
           MOVE W-TOTA-SUFA  TO RD-SUFA.
           MOVE ZEROS        TO RD-TOTA.
           MOVE W-TOTA-PATR  TO RD-PATR.
           MOVE ZEROS        TO RD-EMPL.
           MOVE W-TOTA-COTI  TO RD-COTI.
           MOVE ZEROS        TO RD-PAGA.
           MOVE W-TOTA-SUB1  TO RD-SUB1.

           PERFORM I-TITULOS-REPORTES THRU F-TITULOS-REPORTES.
           WRITE REG-REPORTES FROM R-DETALLE AFTER 1.
           ADD 1 TO W-LINEAS-R.

           PERFORM I-TITULOS-REPORTES THRU F-TITULOS-REPORTES.
           WRITE REG-REPORTES FROM I-TITULO-06 AFTER 1.
           ADD 1 TO W-LINEAS-R.
       F-TOTAL-TOTALR. EXIT.
      *
       I-PROCESO-REPORTE-INT.
           PERFORM I-LEE-C-WTEMN786 THRU F-LEE-C-WTEMN786.
           IF FIN-ARCH-WTEMN786 = 1
             GO F-PROCESO-REPORTE-INT.
           DISPLAY SPACES SIZE 80 LINE 25 POSITION 01
           DISPLAY WTEMN786-LLAVE-00 LINE 25 POSITION 01
           PERFORM I-WTEMN786-REPORTE THRU F-WTEMN786-REPORTE.
       F-PROCESO-REPORTE-INT. EXIT.
      *
       I-WTEMN786-REPORTE.
           MOVE ZEROS TO W-ACUM-LINE.
           PERFORM I-TRAER-ENTIDADR THRU F-TRAER-ENTIDADR.
           MOVE WTEMN786-BASE         TO RD-BASE.
           MOVE ZEROS TO W-AUXE-CALCULO
                         W-AUXP-CALCULO.
           COMPUTE W-AUXE-CALCULO ROUNDED =
             WTEMN786-APORTE-SALUD * 0.3333333333.
           ADD W-AUXE-CALCULO TO W-TOTA-SALUE
                                 W-LINE-EMPL.
           MOVE W-AUXE-CALCULO TO RD-SALUE.
           COMPUTE W-AUXP-CALCULO =
             WTEMN786-APORTE-SALUD - W-AUXE-CALCULO.
           MOVE W-AUXP-CALCULO TO RD-SALUP.
           ADD W-AUXP-CALCULO TO W-TOTA-SALUP
                                 W-LINE-PATR.

           MOVE WTEMN786-APORTE-SALUD TO RD-APORTE-SALUD.
           ADD  WTEMN786-APORTE-SALUD TO W-TOTA-SALUD.

           MOVE WTEMN786-APORTE-PENSI TO RD-APORTE-PENSI.
           ADD  WTEMN786-APORTE-PENSI TO W-TOTA-PENSI.
           MOVE ZEROS TO W-AUXE-CALCULO
                         W-AUXP-CALCULO.
           COMPUTE W-AUXE-CALCULO ROUNDED =
             WTEMN786-APORTE-PENSI * 0.2496296296.
           ADD W-AUXE-CALCULO TO W-TOTA-PENSE
                                 W-LINE-EMPL.
           MOVE W-AUXE-CALCULO TO RD-PENSE.
           COMPUTE W-AUXP-CALCULO =
             WTEMN786-APORTE-PENSI - W-AUXE-CALCULO.
           ADD W-AUXP-CALCULO TO W-TOTA-PENSP
                                 W-LINE-PATR.
           MOVE W-AUXP-CALCULO TO RD-PENSP.

           MOVE WTEMN786-APORTE-FSP   TO RD-APORTE-FSP.
           ADD WTEMN786-APORTE-FSP TO W-LINE-EMPL
                                      W-TOTA-FSP.

           MOVE WTEMN786-APORTE-VOLUN TO RD-APORTE-VOLUN.
           ADD WTEMN786-APORTE-VOLUN TO W-LINE-EMPL
                                        W-TOTA-VOLUN.

           MOVE WTEMN786-APORTE-RIESG TO RD-APORTE-RIESG.
           ADD WTEMN786-APORTE-RIESG TO W-LINE-PATR
                                        W-TOTA-RIESG.

           MOVE WTEMN786-DESCUE-INCAP TO RD-DESCUE-INCAP
           ADD  WTEMN786-DESCUE-INCAP TO W-TOTA-INCAP.

           MOVE WTEMN786-CAJAS-ICBF   TO RD-ICBF.
           ADD  WTEMN786-CAJAS-ICBF   TO W-TOTA-ICBF.

           MOVE WTEMN786-CAJAS-SENA   TO RD-SENA.
           ADD  WTEMN786-CAJAS-SENA   TO W-TOTA-SENA.

           MOVE WTEMN786-CAJAS-SUFA   TO RD-SUFA.
           ADD  WTEMN786-CAJAS-SUFA   TO W-TOTA-SUFA.

           MOVE WTEMN786-CAJAS-TOTA   TO RD-TOTA.
           ADD  WTEMN786-CAJAS-TOTA   TO W-TOTA-TOTA.

           COMPUTE W-LINE-COTI = W-LINE-EMPL + W-LINE-PATR.

           MOVE ZEROS TO W-LINE-SUB1.
           COMPUTE W-LINE-SUB1 = W-LINE-COTI - WTEMN786-DESCUE-INCAP.
           MOVE W-LINE-SUB1 TO RD-SUB1.
           ADD W-LINE-SUB1 TO W-TOTA-SUB1.

           COMPUTE W-LINE-PAGA = W-LINE-SUB1 +
                                 WTEMN786-CAJAS-TOTA.

           MOVE W-LINE-PATR TO RD-PATR.
           MOVE W-LINE-EMPL TO RD-EMPL.
           MOVE W-LINE-COTI TO RD-COTI.
           MOVE W-LINE-PAGA TO RD-PAGA.
           ADD W-LINE-PATR TO W-TOTA-PATR.
           ADD W-LINE-EMPL TO W-TOTA-EMPL.
           ADD W-LINE-COTI TO W-TOTA-COTI.
           ADD W-LINE-PAGA TO W-TOTA-PAGA.

           PERFORM I-TITULOS-REPORTES THRU F-TITULOS-REPORTES.
           WRITE REG-REPORTES FROM R-DETALLE AFTER 1.
           ADD 1 TO W-LINEAS-R.
       F-WTEMN786-REPORTE. EXIT.
      *
       I-TITULOS-REPORTES.
           IF W-LINEAS-R = 0 OR W-LINEAS-R > 57
            NEXT SENTENCE
           ELSE
            GO F-TITULOS-REPORTES.

           PERFORM I-VARREPOR-RENC1478 THRU F-VARREPOR-RENC1478.
           MOVE I-TITULO-01 TO E14-03-DESINF.
           MOVE I-TITULO-02 TO E14-07-TITU.
           MOVE I-TITULO-05 TO E14-08-TITU.

           ADD 1 TO W-PAGINA-R.
           MOVE W-PAGINA-R TO ENC14-PAGINA.
           MOVE "R E S U M E N    N I V E L    N A C I O N A L" TO
             E14-02-DESINF.
           PERFORM I-REPORTES-RENC1478 THRU F-REPORTES-RENC1478.
           MOVE 9 TO W-LINEAS-R.
       F-TITULOS-REPORTES. EXIT.
      *
       I-TRAER-ENTIDADR.
           IF WTEMN786-FUENTE = 1 OR
              WTEMN786-FUENTE = 2
             PERFORM I-ENTIDAD-AFPR THRU F-ENTIDAD-AFPR.

           IF WTEMN786-FUENTE = 3
             PERFORM I-ENTIDAD-EPSR THRU F-ENTIDAD-EPSR.

           IF WTEMN786-FUENTE = 4
             PERFORM I-ENTIDAD-CAJR THRU F-ENTIDAD-CAJR.
       F-TRAER-ENTIDADR. EXIT.
      *
       I-ENTIDAD-CAJR.
           MOVE WTEMN786-CODIGO TO COD-CJASUBSI.
           PERFORM I-LEE-CJASUBSI-I00 THRU F-LEE-CJASUBSI-I00.
           IF FIN-ARCH-CJASUBSI = 1
             MOVE "N.N." TO NOM-CJASUBSI.
           MOVE NOM-CJASUBSI TO RD-ENTIDA.
       F-ENTIDAD-CAJR. EXIT.
      *
       I-ENTIDAD-EPSR.
           MOVE WTEMN786-CODIGO TO COD-PROMSALU.
           PERFORM I-LEE-PROMSALU-I00 THRU F-LEE-PROMSALU-I00.
           IF FIN-ARCH-PROMSALU = 1
             MOVE "N.N." TO NOM-PROMSALU.
           MOVE NOM-PROMSALU TO RD-ENTIDA.
       F-ENTIDAD-EPSR. EXIT.
      *
       I-ENTIDAD-AFPR.
           MOVE WTEMN786-CODIGO TO COD-FPENSION.
           PERFORM I-LEE-FPENSION-I00 THRU F-LEE-FPENSION-I00.
           IF FIN-ARCH-FPENSION = 1
             MOVE "N.N." TO NOM-FPENSION.
           MOVE NOM-FPENSION TO RD-ENTIDA.
       F-ENTIDAD-AFPR. EXIT.
      *
       I-FIN-MODE.
           MOVE  SPACES  TO  REG-INFORMES.
           WRITE  REG-INFORMES  AFTER PAGE.
           MOVE  SPACES  TO  REG-REPORTES.
           WRITE  REG-REPORTES  AFTER PAGE.
           MOVE  SPACES  TO  REG-LISTADOS.
           WRITE  REG-LISTADOS  AFTER PAGE.

           CLOSE EMPRESAS AUTOAPOR INFORMES WTEMP786
                 WTEMN786 REPORTES TARIESGO NOMICIUD PROMSALU
                 FPENSION CJASUBSI CERTIFIC ACUMSESO.

           CLOSE TBREDECI CNCUADRO CNPARAFI MVDOCTOS.

           IF IND-EPSLIQUI = 0
             CLOSE EPSLIQUI.

           IF IND-CAJACOLT = 0
             CLOSE CAJACOLT.

           IF IND-FONPENSI = 0
             CLOSE FONPENSI.

           EXIT  PROGRAM.
           STOP  RUN.
       F-FIN-MODE. EXIT.
      *
           COPY "..\PRO\USUARIOS.PRO".
           COPY "..\PRO\OPCIONES.PRO".
           COPY "..\PRO\NO-ERROR.PRO".
           COPY "..\PRO\TRUQUITO.PRO".
           COPY "..\PRO\CONFIRM1.PRO".
           COPY "..\PRO\PANTALLA.PRO".
           COPY "..\PRO\MESANOEL.PRO".
           COPY "..\PRO\INCA1478.PRO".
           COPY "..\PRO\RENC1478.PRO".
           COPY "..\PRO\PARACONT.PRO".
      *
           COPY "..\PLB\INFORMES.PLB".
           COPY "..\PLB\REPORTES.PLB".
           COPY "..\PLB\AUTOAPOR.PLB".
           COPY "..\PLB\FONPENSI.PLB".
           COPY "..\PLB\ACUMSESO.PLB".
           COPY "..\PLB\EPSLIQUI.PLB".
           COPY "..\PLB\CAJACOLT.PLB".
           COPY "..\PLB\ACINCVAC.PLB".
           COPY "..\PLB\FORMAUTO.PLB".
           COPY "..\PLB\LISTADOS.PLB".
           COPY "..\PLB\WTEMP786.PLB".
           COPY "..\PLB\WTEMN786.PLB".
           COPY "..\PLB\FORMUEPS.PLB".
           COPY "..\PLB\MVDOCTOS.PLB".
           COPY "..\PLB\CERTIFIC.PLB".
      *
           COPY "..\START\AUTOAPOR.M00".
           COPY "..\START\WTEMP786.M00".
           COPY "..\START\FONPENSI.M00".
           COPY "..\START\EPSLIQUI.M00".
           COPY "..\START\WTEMN786.M00".
           COPY "..\START\CAJACOLT.M00".
           COPY "..\START\FORMAUTO.M00".
           COPY "..\START\FORMUEPS.M00".
      *
           COPY "..\LEE\AUTOAPOR.SEQ".
           COPY "..\LEE\WTEMP786.SEQ".
           COPY "..\LEE\FONPENSI.SEQ".
           COPY "..\LEE\EPSLIQUI.SEQ".
           COPY "..\LEE\WTEMN786.SEQ".
           COPY "..\LEE\CAJACOLT.SEQ".
           COPY "..\LEE\FORMAUTO.SEQ".
           COPY "..\LEE\WTEMP786.I00".
           COPY "..\LEE\EMPRESAS.I00".
           COPY "..\LEE\WTEMN786.I00".
           COPY "..\LEE\CONTRATO.I00".
           COPY "..\LEE\TABLAEMP.I00".
           COPY "..\LEE\TARIESGO.I00".
           COPY "..\LEE\ACINCVAC.I00".
           COPY "..\LEE\NOMICIUD.I00".
           COPY "..\LEE\PROMSALU.I00".
           COPY "..\LEE\FPENSION.I00".
           COPY "..\LEE\CJASUBSI.I00".
           COPY "..\LEE\ACUMSESO.I00".
           COPY "..\LEE\FORMUEPS.SEQ".
      *
           COPY "..\OPE\WTEMP786.WRI".
           COPY "..\OPE\WTEMP786.REW".
           COPY "..\OPE\WTEMN786.WRI".
           COPY "..\OPE\WTEMN786.REW".
      *
           COPY "..\STA\ACUMSESO.STA".
      ******************************************************************
